#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>
```


```
</details>
#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>
```

aws_vpc.vpc_fiap: Refreshing state... [id=vpc-0ca3300e837ac65ed]
aws_iam_role.cluster: Refreshing state... [id=eks-cluster-role]
aws_iam_role.node: Refreshing state... [id=eks-node-group-role]
aws_s3_bucket.spoobucket-aula: Refreshing state... [id=spoo-ent9-backend]
aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
aws_internet_gateway.igw: Refreshing state... [id=igw-02024ac4b4f93d682]
aws_security_group.sg: Refreshing state... [id=sg-00ea72bb88c929b8c]
aws_subnet.subnet_public[2]: Refreshing state... [id=subnet-076d1d3d0a35d88ee]
aws_subnet.subnet_public[0]: Refreshing state... [id=subnet-06e1721c47d0cc5dc]
aws_subnet.subnet_public[1]: Refreshing state... [id=subnet-0dbee360e79feaabe]
aws_route_table.rt_public: Refreshing state... [id=rtb-09024cc1af9c6a82f]
aws_route_table_association.rt_association_1: Refreshing state... [id=rtbassoc-026c75741dcd14619]
aws_route_table_association.rt_association_0: Refreshing state... [id=rtbassoc-07b115033333b298b]
aws_route_table_association.rt_association_2: Refreshing state... [id=rtbassoc-05da0c1c090fb9a5d]
aws_eks_cluster.cluster: Refreshing state... [id=eks-spoo-ent9-backend]
aws_eks_access_entry.access_entry: Refreshing state... [id=eks-spoo-ent9-backend:arn:aws:iam::579375260812:user/camila]
aws_eks_access_policy_association.access_entry_association: Refreshing state... [id=eks-spoo-ent9-backend#arn:aws:iam::579375260812:user/camila#arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminViewPolicy]
data.aws_eks_cluster.cluster: Reading...
data.aws_eks_cluster_auth.auth: Reading...
aws_eks_node_group.node: Refreshing state... [id=eks-spoo-ent9-backend:nodeg-spoo-ent9-backend]
data.aws_eks_cluster_auth.auth: Read complete after 0s [id=eks-spoo-ent9-backend]
data.aws_eks_cluster.cluster: Read complete after 0s [id=eks-spoo-ent9-backend]
kubectl_manifest.aws_auth: Refreshing state... [id=/api/v1/namespaces/kube-system/configmaps/aws-auth]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_eks_access_entry.app_deploy_actions_access will be created
  + resource "aws_eks_access_entry" "app_deploy_actions_access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-spoo-ent9-backend"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::579375260812:role/GitHubAction-AppDeploy-Role"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_entry.infra_actions_access will be created
  + resource "aws_eks_access_entry" "infra_actions_access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-spoo-ent9-backend"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::579375260812:role/GitHubActionRole-DatabaseInfra"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.app_deploy_actions_admin_policy will be created
  + resource "aws_eks_access_policy_association" "app_deploy_actions_admin_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-spoo-ent9-backend"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::579375260812:role/GitHubAction-AppDeploy-Role"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_access_policy_association.infra_actions_admin_policy will be created
  + resource "aws_eks_access_policy_association" "infra_actions_admin_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-spoo-ent9-backend"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::579375260812:role/GitHubActionRole-DatabaseInfra"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_iam_role.cluster will be updated in-place
  ~ resource "aws_iam_role" "cluster" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRoleWithWebIdentity" -> [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          - StringLike   = {
                              - "token.actions.githubusercontent.com:sub" = "repo:craspoo/*"
                            }
                        }
                      ~ Principal = {
                          - Federated = "arn:aws:iam::579375260812:oidc-provider/token.actions.githubusercontent.com"
                          + Service   = "eks.amazonaws.com"
                        }
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "eks-cluster-role"
        name                  = "eks-cluster-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

```
</details>
*Pusher: @2rspoo, Action: `pull_request`*